Performance Testing with JMeter/performance testing on API/test_HTML_Report/statistics.json
{
  "GET_ListUsers" : {
    "transaction" : "GET_ListUsers",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1235.3999999999999,
    "medianResTime" : 1280.0,
    "minResTime" : 834.0,
    "maxResTime" : 1476.0,
    "pct1ResTime" : 1476.0,
    "pct2ResTime" : 1476.0,
    "pct3ResTime" : 1476.0,
    "throughput" : 6.7704807041299935,
    "receivedKBytesPerSec" : 15.197877877454298,
    "sentKBytesPerSec" : 1.2364061442112388
  },
  "POST_CreateUser" : {
    "transaction" : "POST_CreateUser",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 455.50000000000006,
    "medianResTime" : 451.5,
    "minResTime" : 410.0,
    "maxResTime" : 528.0,
    "pct1ResTime" : 527.8,
    "pct2ResTime" : 528.0,
    "pct3ResTime" : 528.0,
    "throughput" : 18.93939393939394,
    "receivedKBytesPerSec" : 22.871537642045453,
    "sentKBytesPerSec" : 4.642370975378788
  },
  "PUT_UpdateUser" : {
    "transaction" : "PUT_UpdateUser",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 390.7,
    "medianResTime" : 391.5,
    "minResTime" : 376.0,
    "maxResTime" : 403.0,
    "pct1ResTime" : 402.7,
    "pct2ResTime" : 403.0,
    "pct3ResTime" : 403.0,
    "throughput" : 19.569471624266143,
    "receivedKBytesPerSec" : 23.41647810665362,
    "sentKBytesPerSec" : 4.835035469667319
  },
  "DELETE_User" : {
    "transaction" : "DELETE_User",
    "sampleCount" : 10,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 420.5,
    "medianResTime" : 419.0,
    "minResTime" : 381.0,
    "maxResTime" : 462.0,
    "pct1ResTime" : 461.9,
    "pct2ResTime" : 462.0,
    "pct3ResTime" : 462.0,
    "throughput" : 19.342359767891683,
    "receivedKBytesPerSec" : 20.624924443907155,
    "sentKBytesPerSec" : 3.8533607350096712
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 40,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 625.5249999999997,
    "medianResTime" : 435.0,
    "minResTime" : 376.0,
    "maxResTime" : 1476.0,
    "pct1ResTime" : 1418.6999999999998,
    "pct2ResTime" : 1476.0,
    "pct3ResTime" : 1476.0,
    "throughput" : 14.044943820224718,
    "receivedKBytesPerSec" : 20.067536429073034,
    "sentKBytesPerSec" : 3.068902519311798
  }
}